<template>
  <div class="xieyi">
    <h3>{{ comName }}个人信用报告查询授权书及服务约定</h3>
    <p>
      尊敬的用户：为了维护您的权益，我们提醒您点击确认了《个人信用报告查询授权书》（以下简称“本授权书”）即视您已阅读本授权书所有条款，并对本授权书各项条款的含义及相应的法律后果已全部通晓并充分理解，同意接受本授权书的约束。请您务必关注您在授权书中的权利、义务，珍惜个人信用！
    </p>
    <h4>一、授权内容</h4>
    <p>
      授权人（亦称“本人”）同意向{{ comName }}（以下简称“被授权人”）郑重授权如下：
    </p>

    <p>
      1.同意被授权人在办理下列业务时，通过金融信用信息基础数据库查询本人信用报告：
    </p>
    <p>（1）审核本人贷款及其他信贷业务申请的；</p>
    <p>（2）审核本人作为担保人或共同还款人的；</p>
    <p>（3）对已发放的本人信贷进行贷后风险管理的；</p>
    <p>
      （4）受理法人、其他组织或自然人（以下合称“信贷申请人”）的信贷申请或对信贷申请人在被授权人处的信贷进行贷后风险管理时，需要查询本人作为信贷申请人的法定代表人、出资人或关联方的信用状况的。
    </p>

    <p>
      2.同意将本人的基本信息和信用信息报送中国人民银行金融信用信息基础数据库。
    </p>
    <p>3.授权期限</p>
    <p>
      （1）若属于上述1中的第（1）、（2）、（3）项情形之一的，授权期限为自本授权书生效之日起至本人在被授权人处相应业务结束之日或债务完全履行完毕之日止；或（2）若属于上述1中的第（4）项情形的，授权期限为自本授权书生效之日起至信贷申请人在被授权人处相应业务结束之日或债务完全履行完毕之日止。
    </p>

    <h4>二、授权书的形式</h4>
    <p>
      授权人同意本授权书以数据电文形式订立；授权人一旦在线确认本授权书，本授权书即生效。
    </p>

    <h4>三、责任约定</h4>
    <p>
      本人确认对本授权书的条款含义及相应的法律后果已全部通晓并充分理解。被授权人可查询和使用信用报告期间，不应超过本授权书授权期限结束之日。被授权人超出授权查询的一切后果及法律责任由被授权人承担。若本人在被授权人处办理的业务未获批准，本人同意被授权人继续保留此查询授权书和相应身份及申请所留信息。
    </p>

    <h4>四、服务约定</h4>
    <p>
      本协议是本人与{{ comName }}所有者之间就{{
        comName
      }}贷款服务等相关事宜所订立的契约，请仔细阅读本协议，本人完全同意和接受该协议的全部条款和内容，全面履行该协议的各项规定，享有和承担相应的权利和义务。
    </p>
    <p>
      1、本人因需要办理贷款业务,特向{{
        comName
      }}提供的本人及家庭成员和单位证件等资料复印件或原件均由本人提供，且真实合法。本人同意{{
        comName
      }}将本人所提供的所有资料保存使用或转交至银行或其他相关机构。办理业务期间如本人提供的资料出现法律纠纷，一切由本人承担！
    </p>
    <p>
      2、本人承诺已知晓贷款资金须按合同约定用途使用，不得挪作他用，不得用于购房（按揭贷款除外），不得用于归还与购房相关的贷款（卖方赎楼贷款除外）及缴纳与购房相关的税费，不得用于归还信用卡，不得进入证券市场，不得用于股本权益性投资、有价证券、理财产品和期货、民间信贷等，不得用于投资古董，不得用于国家明令禁止或限制的生产、经营活动、领域和用途，不得通过转入本人或家庭成员的账户规避贷款用途管理。
    </p>
    <p>
      3、本人承诺不以自己的名义为他人获得贷款，即不能将贷款资金转借他人使用；若违反此项规定，将贷款转借他人，则因此产生的责任及贷款风险将由本人承担本人确认已经认真阅读并全面接受{{
        comName
      }}全部条款，已充分知悉、理解本协议项下的权利、义务和责任，自愿承担由此产生的法律风险。
    </p>
  </div>
</template>

<script>
import { mapState } from 'vuex'
export default {
  computed: {
    ...mapState({
      comName: state => state.userInfo.compName,
    }),
  },
  data() {
    return {}
  },
}
</script>

<style lang="scss" scoped>
.xieyi {
  h3 {
    margin: 0 0 10px;
    text-align: center;
  }
  h4 {
    margin: 0;
  }
  p {
    margin: 0;
  }
}
</style>
